      *****************************************************************
       IDENTIFICATION                  DIVISION.
      *****************************************************************
       PROGRAM-ID.                     CLS01EX06. 
      * ACCEPT 3 VALUES INTO 3 NUMERIC VARIABLES
      * DISPLAY THE AVERAGE OF THE 3 VALUES
      *****************************************************************
       ENVIRONMENT                     DIVISION.
      *****************************************************************
      *****************************************************************
       DATA                            DIVISION.
      *****************************************************************
      *================================================================
       WORKING-STORAGE                 SECTION.
      *================================================================
    
      *****************************************************************
       PROCEDURE                       DIVISION.
      *****************************************************************
        
           
           EXIT PROGRAM.
           STOP RUN.          
