      *****************************************************************
       IDENTIFICATION                  DIVISION.
      *****************************************************************
       PROGRAM-ID.                     CLS01EX02. 
      * ACCEPT A VALUE INTO A VARIABLE
      * DISPLAY THE VALUE OF THE VARIABLE 
      *****************************************************************
       ENVIRONMENT                     DIVISION.
      *****************************************************************
      *****************************************************************
       DATA                            DIVISION.
      *****************************************************************
      *================================================================
       WORKING-STORAGE                 SECTION.
      *================================================================
       
      *****************************************************************
       PROCEDURE                       DIVISION.
      *****************************************************************
           

           EXIT PROGRAM.
           STOP RUN.          
