      *****************************************************************
       IDENTIFICATION                  DIVISION.
      *****************************************************************
       PROGRAM-ID.                     CLS01EX01. 
      * DISPLAY 'HELLO COBOL WORLD' 
      *****************************************************************
       ENVIRONMENT                     DIVISION.
      *****************************************************************
      *****************************************************************
       DATA                            DIVISION.
      *****************************************************************
       working-storage  section.
       01 a pic 99 value 3 .
       01 b pic 99 value 3 .
       01 c pic 99 value 3 .
      *****************************************************************
       PROCEDURE                       DIVISION.
      *****************************************************************
           display 'hello'
           compute a = b + c

           EXIT PROGRAM.
           STOP RUN.
           
