      *****************************************************************
       IDENTIFICATION                  DIVISION.
      *****************************************************************
       PROGRAM-ID.                     CLS01EX04. 
      * ACCEPT 2 VALUES INTO 2 NUMERIC VARIABLES
      * DISPLAY THE SUM OF THE 2 VARIABLES 
      *****************************************************************
       ENVIRONMENT                     DIVISION.
      *****************************************************************
      *****************************************************************
       DATA                            DIVISION.
      *****************************************************************
      *================================================================
       WORKING-STORAGE                 SECTION.
      *================================================================
    
      *****************************************************************
       PROCEDURE                       DIVISION.
      *****************************************************************
        
           
           EXIT PROGRAM.
           STOP RUN.          
