      *****************************************************************
       IDENTIFICATION                  DIVISION.
      *****************************************************************
       PROGRAM-ID.                     CLS01EX05. 
      * ACCEPT 2 VALUES INTO 2 NUMERIC VARIABLES
      * THE FIRST VALUE IS THE LENGTH OF A RECTANGLE
      * THE SECOND VALUE IS THE WIDTH OF A RECTANGLE
      * DISPLAY THE AREA AND THE PERIMETER OF THE RECTANGLE 
      * Reminder:
      *   PERIMETER = 2 * (LENGTH + WIDTH)
      *   AREA = LENGTH * WIDTH
      *****************************************************************
       ENVIRONMENT                     DIVISION.
      *****************************************************************
      *****************************************************************
       DATA                            DIVISION.
      *****************************************************************
      *================================================================
       WORKING-STORAGE                 SECTION.
      *================================================================
    
      *****************************************************************
       PROCEDURE                       DIVISION.
      *****************************************************************
     

           EXIT PROGRAM.
           STOP RUN.          
