      *****************************************************************
       IDENTIFICATION                  DIVISION.
      *****************************************************************
       PROGRAM-ID.                     CLS01EX02. 
      * ACCEPT A VALUE INTO A VARIABLE
      * DISPLAY THE VALUE OF THE VARIABLE 
      *****************************************************************
       ENVIRONMENT                     DIVISION.
      *****************************************************************
      *****************************************************************
       DATA                            DIVISION.
      *****************************************************************
      *================================================================
       WORKING-STORAGE                 SECTION.
      *================================================================
       01  INP-A                       PIC X(01). 
      *****************************************************************
       PROCEDURE                       DIVISION.
      *****************************************************************
           DISPLAY 'Type in 1 character...'
           ACCEPT INP-A
           DISPLAY 'The content of INP-A is: ' INP-A

           EXIT PROGRAM.
           STOP RUN.          
