      *****************************************************************
       IDENTIFICATION                  DIVISION.
      *****************************************************************
       PROGRAM-ID.                     PROGRAM1. 
      *****************************************************************
       ENVIRONMENT                     DIVISION.
      *****************************************************************
      *================================================================
       CONFIGURATION                   SECTION.
      *================================================================
      *================================================================
       INPUT-OUTPUT                   SECTION.
      *================================================================
       FILE-CONTROL.
      *****************************************************************
       DATA                            DIVISION.
      *****************************************************************
      *================================================================
       FILE                            SECTION.
      *================================================================
      *================================================================
       WORKING-STORAGE                 SECTION.
      *================================================================
      *================================================================
       LINKAGE                         SECTION.
      *================================================================
      *****************************************************************
       PROCEDURE                       DIVISION.
      *****************************************************************
           DISPLAY 'HELLO COBOL WORLD!'

           EXIT PROGRAM.
           STOP RUN.
           
